//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**             5555 Oakbrook Pkwy, Norcross, GA 30093               **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: ACPI.UNI
//
// Description: ACPI Form String Definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_ACPI_FORM                   #language eng "ACPI Settings"

#string STR_ACPI_FORM_HELP              #language eng "System ACPI Parameters."

#string STR_ACPI_SLEEP_PROMPT           #language eng "ACPI Sleep State"

#string STR_ACPI_SLEEP_HELP             #language eng "Select ACPI sleep state the system will enter when the SUSPEND button is pressed."

#string STR_ACPI_SLEEP_S1               #language eng "S1 only(CPU Stop Clock)"

#string STR_ACPI_SLEEP_S3               #language eng "S3 only(Suspend to RAM)"

#string STR_ACPI_SLEEP_NO               #language eng "Suspend Disabled"

#string STR_ACPI_SLEEP_AUTO             #language eng "Both S1 and S3 available for OS to choose from"

#string STR_ACPI_S4_PROMPT              #language eng "Enable Hibernation"

#string STR_ACPI_S4_HELP                #language eng "Enables or Disables System ability to Hibernate (OS/S4 Sleep State). This option may be not effective with some OS."

#string STR_ACPI_LOCK_LEGACY_DEV_PROMPT #language eng "Lock Legacy Resources"

#string STR_ACPI_LOCK_LEGACY_DEV_HELP   #language eng "Enables or Disables Lock of Legacy Resources"

#string STR_ACPI_AUTO_PROMPT            #language eng "Enable ACPI Auto Configuration"

#string STR_ACPI_AUTO_HELP              #language eng "Enables or Disables BIOS ACPI Auto Configuration."

#string STR_S3_VIDEO_REPOST_PROMPT      #language eng "S3 Video Repost"
#string STR_S3_VIDEO_REPOST_HELP        #language eng "Enable or Disable S3 Video Repost"

#string STR_FORCE_TO_ACPI1_PROMPT       #language eng "Force to ACPI ver. 1.1"
#string STR_FORCE_TO_ACPI1_HELP         #language eng "Enable or Disable Generate only ACPI tables for version 1.1"

#string STR_ACPI_DISABLED               #language eng "Disabled"
#string STR_ACPI_ENABLED                #language eng "Enabled"

//#string <string name> #language eng ""

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**             5555 Oakbrook Pkwy, Norcross, GA 30093               **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************